{
	"siteTitle": "Rimtoken - The Future of Decentralized Innovation",
	"navAbout": "About",
	"navFeatures": "Features",
	"navTeam": "Team",
	"navMarket": "Market",
	"navCommunity": "Community",
	"navLaunchApp": "Launch App",
	"langEN": "EN",
	"langAR": "AR",
	"langZH": "ZH",
	"langFR": "FR",
	"welcomeToRimtoken": "Welcome to Rimtoken",
	"welcomeSubtitle": "Powering the next generation of decentralized applications and fostering innovation on the Outer Rim Network.",
	"getStarted": "Get Started",
	"learnMore": "Learn More",
	"login": "Login",
	"register": "New Account",
	"authPageTitleRegister": "Create New Account",
	"authPageSubtitleRegister": "Create an account to access Rimtoken digital wallet services",
	"authPageTitleLogin": "Login to Your Account",
	"authPageSubtitleLogin": "Welcome back! Sign in to access your account.",
	"personalInformation": "Personal Information",
	"firstNameLabel": "First Name *",
	"lastNameLabel": "Last Name",
	"usernameLabel": "Username",
	"emailLabel": "Email",
	"passwordLabel": "Password",
	"confirmPasswordLabel": "Confirm Password",
	"tradingOptionsLabel": "Trading Options",
	"createAccountButton": "Create Account",
	"loginButton": "Login",
	"loginEmailOrUsernameLabel": "Email or Username",
	"homeWelcomeMessage": "Welcome to Rim Token",
	"homeWelcomeSubMessage": "The most secure and easy platform to manage your encrypted currencies and deal with Web3.",
	"footerRights": "RimToken. All rights reserved.",
	"teamRoleFounder": "Founder & CEO",
	"teamBioAnbarzan": "Anbarzan led the development of RimToken from the start, with extensive experience in blockchain and digital entrepreneurship.",
	"teamRoleCOO": "COO",
	"teamRoleLeadDev": "Lead Developer",
	"teamBioHatan": "Hatan leads the programming team and has succeeded in building smart, secure AI-based solutions.",
	"teamRoleCyber": "Cybersecurity Expert",
	"teamBioJoen": "Joen ensures the platform's protection from cyberattacks, with expertise in blockchain security.",
	"teamRoleMarketing": "Digital Marketing Manager",
	"teamBioMazin": "Mazin led successful marketing campaigns and contributed to RimToken's global reach.",
	"teamRoleData": "Data Analyst",
	"teamBioOthman": "Othman Kamra specializes in big data analysis and extracting insights to support decision-making.",
	"aboutTitle": "About Rimtoken (RIM)",
	"aboutIntro": "Rimtoken (RIM) is more than just a digital currency; it's the lifeblood of the Outer Rim Network – a vibrant, decentralized ecosystem designed for pioneers. We are building a launchpad for creators, innovators, and communities who are pushing the boundaries of what's possible in the digital realm, from decentralized science (DeSci) and emergent art forms to next-generation Web3 experiences.",
	"aboutVisionTitle": "Our Vision: Empowering the Edge of Innovation",
	"aboutVision": "We envision a future where innovation isn't stifled by traditional gatekeepers, where creators have true ownership of their work, and where communities can self-organize, fund their passions, and thrive. Rimtoken is our instrument to help build this future, fostering an open, transparent, and collaborative environment on the Outer Rim Network. We believe the most groundbreaking ideas often emerge from the 'rim' – the unconventional thinkers and daring explorers – and we're here to provide them with the tools and support they need.",
	"aboutPurposeTitle": "What is Rimtoken's Purpose?",
	"aboutPurposeList": [
		"Fuel the Ecosystem: Serve as the primary medium of exchange for all transactions within the Outer Rim Network. This includes acquiring unique digital assets (NFTs), accessing services, participating in exclusive events, and utilizing platform tools.",
		"Empower Decentralized Governance: Grant RIM holders the power to shape the future of the Outer Rim Network. Through on-chain voting, token holders can influence key decisions, from protocol upgrades and feature development to treasury management and community grant allocations.",
		"Incentivize Participation & Contribution: Reward users, developers, and creators for their active engagement and valuable contributions to the network. This includes staking RIM for network security and rewards, creating popular content, or building innovative dApps.",
		"Support Innovation & Incubation: Provide a mechanism for new projects and ideas to gain visibility, secure funding through community-backed initiatives, and launch within the supportive framework of the Outer Rim Network."
	],
	"aboutPrinciplesTitle": "Core Principles of the Rimtoken Ecosystem:",
	"aboutPrinciplesList": [
		"Decentralization: Committed to reducing single points of failure and control, distributing power to the community.",
		"Transparency: Leveraging blockchain technology for auditable transactions and open governance processes.",
		"Community Ownership: Ensuring that those who build and use the network have a genuine stake in its success and direction.",
		"Innovation: Continuously seeking and supporting novel applications of Web3 technology.",
		"Accessibility: Striving to create an inclusive platform that lowers barriers to entry for creators and users alike."
	],
	"aboutJoinTitle": "Join the Rimtoken Journey",
	"aboutJoin": "Whether you're a developer looking to build the next groundbreaking dApp, an artist exploring new digital mediums, a scientist seeking collaborative funding, or simply someone passionate about the future of a truly decentralized and user-owned internet, Rimtoken and the Outer Rim Network welcome you. Explore our ecosystem, get involved in our community, and be part of the movement building at the rim of innovation.",
	"passwordsDoNotMatch": "passwordsDoNotMatch",
	"featuresTitle": "Key Features of Rimtoken (RIM)",
	"featuresList": [
		{
			"title": "Swift & Economical Transactions",
			"points": [
				"Near-instantaneous transaction confirmations, ideal for everyday use and time-sensitive operations.",
				"Ultra-low transaction fees for both micropayments and larger transfers."
			]
		},
		{
			"title": "Robust Security Framework",
			"points": [
				"State-of-the-art cryptographic techniques and resilient consensus mechanism.",
				"Regular security audits and a dedicated security team ensure network integrity."
			]
		},
		{
			"title": "Scalable Architecture",
			"points": [
				"Handles high throughput of transactions for mass adoption.",
				"Future-proofed to accommodate growing user demand and ecosystem expansion."
			]
		},
		{
			"title": "Community-Driven Governance",
			"points": [
				"Token holders participate in key governance decisions.",
				"Transparent voting mechanism ensures the community's voice is heard."
			]
		},
		{
			"title": "Ecosystem Integration & Utility",
			"points": [
				"Native utility token powering a growing ecosystem of DApps, platforms, and services.",
				"Use RIM for exclusive features, services, and unique platform offerings."
			]
		},
		{
			"title": "Staking & Rewards Mechanism",
			"points": [
				"Secure the network and earn passive rewards by staking RIM tokens.",
				"Innovative staking model offers competitive returns and incentivizes participation."
			]
		},
		{
			"title": "User-Centric Design",
			"points": [
				"Intuitive wallet interfaces and platform interactions.",
				"Accessible even for crypto newcomers."
			]
		}
	],
	"followUs": "followUs",
	"userExists": "userExists",
	"dashboard": "Dashboard",
	"welcome": "Welcome",
	"marketOverview": "marketOverview",
	"latestMarketNews": "latestMarketNews",
	"btcName": "btcName",
	"ethName": "ethName",
	"aaplName": "aaplName",
	"googlName": "googlName",
	"goldName": "goldName",
	"oilName": "oilName",
	"marketNewsList": "marketNewsList",
	"logout": "logout",
	"wallet": "wallet",
	"trade": "trade",
	"buySell": "buySell",
	"sellDigitalCurrency": "sellDigitalCurrency",
	"dashboardTitle": "dashboardTitle",
	"sellBuy": "sellBuy",
	"security": "security",
	"welcomeUser": "welcomeUser",
	"dashboardSubtitle": "dashboardSubtitle",
	"walletCardTitle": "walletCardTitle",
	"walletCardDesc": "walletCardDesc",
	"manageWallet": "manageWallet",
	"marketCardTitle": "marketCardTitle",
	"marketCardDesc": "marketCardDesc",
	"goToTrade": "goToTrade",
	"accountSummary": "accountSummary",
	"totalWalletBalance": "totalWalletBalance",
	"last24hPL": "last24hPL",
	"lastActivity": "lastActivity",
	"lastActivitySample": "lastActivitySample",
	"Sorry, page not found!": "Sorry, page not found!",
	"Something broke!": "Something broke!",
	"invalidCredentials": "invalidCredentials",
	"swap": "swap"
}